examples/wedge15Ma5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// 15-degree compression ramp ("obstacle"), M=5 inviscid inflow.  Upstream
// OpenFOAM-4.x tutorial geometry, unchanged.  The ramp foot is at x=0; the
// surface (0,0)->(0.3048, 0.081670913853) makes atan(0.08167/0.3048)=15 deg
// exactly, so an attached oblique shock forms at the foot.
//
// GRID-REFINEMENT STUDY (the ONLY thing you edit between runs):
// the mesh is uniform with square cells, so the representative cell size is
//   h = 0.1524 / Ny.
//   ----------------------------------------------------------------
//   grid        (block1)      (block2)       cells     h
//   Coarse      (20 20 1)     (40 20 1)       1200     0.0076200
//   Medium      (40 40 1)     (80 40 1)       4800     0.0038100
//   Fine        (80 80 1)     (160 80 1)     19200     0.0019050   <-- as shipped
//   Extra-fine  (160 160 1)   (320 160 1)    76800     0.0009525
//   ----------------------------------------------------------------
// Edit the two (nx ny 1) tuples below per the table; change nothing else.

convertToMeters 1;

vertices
(
    (-0.15242 0       -0.005)
    ( 0       0       -0.005)
    ( 0.3048  0.081670913853  -0.005)
    (-0.15242 0.1524 -0.005)
    ( 0       0.1524 -0.005)
    ( 0.3048  0.1524 -0.005)

    (-0.15242 0        0.005)
    ( 0       0        0.005)
    ( 0.3048  0.081670913853 0.005)
    (-0.15242 0.1524  0.005)
    ( 0       0.1524  0.005)
    ( 0.3048  0.1524  0.005)
);

blocks
(
    hex (0 1 4 3 6 7 10 9 ) (80 80 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) (160 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 7 6)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 9 10 4)
            (4 10 11 5)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (1 2 8 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
